app/controllers/school_classes_controller.rb

INSERT INTO "school_classes" ("title", "room_number", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "Geometry "], ["room_number", 404], ["created_at", "2021-08-31 21:18:00.728707"], ["updated_at", "2021-08-31 21:18:00.728707"]]
---
    def create
        @school_class = SchoolClass.new(post_params)
        @school_class.save

SELECT  "school_classes".* FROM "school_classes" WHERE "school_classes"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "school_classes" SET "room_number" = ?, "updated_at" = ? WHERE "school_classes"."id" = ?  [["room_number", 402], ["updated_at", "2021-08-31 21:18:32.543686"], ["id", 1]]
---
    def update
        @school_class = SchoolClass.find(params[:id])
        @school_class.update(post_params)