app/controllers/students_controller.rb

SELECT  "students".* FROM "students" WHERE "students"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
UPDATE "students" SET "first_name" = ?, "last_name" = ?, "updated_at" = ? WHERE "students"."id" = ?  [["first_name", "Ethan"], ["last_name", "Bassford"], ["updated_at", "2021-08-31 21:17:27.074690"], ["id", 3]]
---
    def update
        @student = Student.find(params[:id])
        @student.update(post_params)